In [57]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [72]:
df = pd.read_csv('home.csv')
df

   Area   bedroom  bathroom  balcony   price
0   2700      2.0       1.0      2.0  550000
1   3500      3.0       2.0      NaN  560000
2   4500      2.0       NaN      2.0  600000
3   4000      NaN       2.0      1.0  570000
4   2500      NaN       1.0      2.0  300000
5   3600      3.0       2.0      1.0  650000
6   4100      4.0       2.0      NaN  450000
7   6000      4.0       3.0      2.0  700000

In [73]:
df.bathroom.median()

2.0

In [81]:
df.bathroom = df.bathroom.fillna(df.bathroom.median())
df

   Area   bedroom  bathroom  balcony   price
0   2700      2.0       1.0      2.0  550000
1   3500      3.0       2.0      NaN  560000
2   4500      2.0       2.0      2.0  600000
3   4000      3.0       2.0      1.0  570000
4   2500      3.0       1.0      2.0  300000
5   3600      3.0       2.0      1.0  650000
6   4100      4.0       2.0      NaN  450000
7   6000      4.0       3.0      2.0  700000

In [62]:
df.bathroom.median()

2.0

In [74]:
df.balcony.median()

2.0

In [82]:
df.balcony = df.balcony.fillna(df.balcony.median())
df

   Area   bedroom  bathroom  balcony   price
0   2700      2.0       1.0      2.0  550000
1   3500      3.0       2.0      2.0  560000
2   4500      2.0       2.0      2.0  600000
3   4000      3.0       2.0      1.0  570000
4   2500      3.0       1.0      2.0  300000
5   3600      3.0       2.0      1.0  650000
6   4100      4.0       2.0      2.0  450000
7   6000      4.0       3.0      2.0  700000

In [83]:
df.bedroom.median()
df.bedroom=df.bedroom.fillna(df.bedroom.median())
df

   Area   bedroom  bathroom  balcony   price
0   2700      2.0       1.0      2.0  550000
1   3500      3.0       2.0      2.0  560000
2   4500      2.0       2.0      2.0  600000
3   4000      3.0       2.0      1.0  570000
4   2500      3.0       1.0      2.0  300000
5   3600      3.0       2.0      1.0  650000
6   4100      4.0       2.0      2.0  450000
7   6000      4.0       3.0      2.0  700000

In [84]:
X=df.drop('price',axis=1)
Y=df.price
print(X)
print(Y)

   Area   bedroom  bathroom  balcony
0   2700      2.0       1.0      2.0
1   3500      3.0       2.0      2.0
2   4500      2.0       2.0      2.0
3   4000      3.0       2.0      1.0
4   2500      3.0       1.0      2.0
5   3600      3.0       2.0      1.0
6   4100      4.0       2.0      2.0
7   6000      4.0       3.0      2.0
0    550000
1    560000
2    600000
3    570000
4    300000
5    650000
6    450000
7    700000
Name: price, dtype: int64

In [85]:
reg = linear_model.LinearRegression()
reg.fit(X,Y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [86]:
from sklearn.model_selection import train_test_split 
x_train,x_tets,y_train,y_test =train_test_split(x,y,test_size=0.3,random_state = 2)
reg.fit(x_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [87]:
reg.coef_

array([-2.00e+02, -5.00e+03,  4.10e+05,  1.25e+05])

In [88]:
reg.intercept_

439999.99999999406

In [90]:
reg.predict([[4100,2,3,2]])

array([1090000.])